In [1]:
import numpy as np
import pandas as pd
import scipy.stats as stats
import matplotlib.pyplot as plt
%matplotlib inline
import math

In [2]:
diet = pd.read_csv("C:/Users/Latha/Downloads/dietstudy.csv")

In [4]:
diet.describe()

,patid,age,tg0,tg1,tg2,tg3,tg4,wgt0,wgt1,wgt2,wgt3,wgt4
count,16.000000,16.000000,16.00000,16.000000,16.00000,16.000000,16.000000,16.000000,16.000000,16.00000,16.000000,16.000000
mean,8.500000,54.687500,138.43750,124.562500,124.37500,118.812500,124.375000,198.375000,196.125000,194.12500,192.125000,190.312500
std,4.760952,6.915863,29.04013,25.126264,21.85368,33.255012,29.411732,33.472128,33.668729,33.49801,33.915336,33.507648
min,1.000000,45.000000,94.00000,93.000000,86.00000,75.000000,82.000000,151.000000,146.000000,144.00000,144.000000,140.000000
25%,4.750000,49.000000,110.75000,103.750000,112.00000,88.250000,99.250000,168.500000,166.750000,165.75000,162.000000,161.000000
50%,8.500000,54.000000,142.00000,124.000000,127.00000,116.000000,122.000000,198.500000,198.000000,194.50000,192.000000,192.500000
75%,12.250000,61.000000,157.00000,142.500000,138.50000,144.250000,148.500000,224.750000,221.500000,218.50000,218.250000,216.750000
max,16.000000,64.000000,186.00000,185.000000,157.00000,195.000000,174.000000,257.000000,255.000000,254.00000,252.000000,249.000000

Null hypothesis: There is no difference in the levels of Triglycerides and weight of individual after using new diet for 6 months.

Alternate hypothesis: There  has been a significant difference in the levels of Triglycerides and weight of individual after using new diet for 6 months.

Using Paired-samples T test

In [6]:
creditpromo = pd.read_csv("C:/Users/Latha/Downloads/creditpromo.csv")

In [7]:
creditpromo.head()

     id         insert      dollars
0   148       Standard  2232.771979
1   572  New Promotion  1403.807542
2   973       Standard  2327.092181
3  1096       Standard  1280.030541
4  1541  New Promotion  1513.563200

In [9]:
creditpromo.shape

(500, 3)

In [18]:
group1 = creditpromo[0:250]

In [19]:
group1.tail()

        id         insert      dollars
245  62278  New Promotion   993.069760
246  62296  New Promotion  1694.107034
247  62406  New Promotion  1861.461267
248  62504  New Promotion  1469.619242
249  62902       Standard  1859.845349

In [23]:
group2 = creditpromo[250:]

In [25]:
group2.tail()

         id         insert      dollars
495  130163  New Promotion  1513.060134
496  130204  New Promotion  1020.757943
497  130255       Standard  1919.856304
498  130583       Standard  1863.014814
499  130682       Standard  1295.012183

2 independent group comparison

In [26]:
pollination = pd.read_csv("C:/Users/Latha/Downloads/pollination.csv")

In [27]:
pollination.head()

     Group  Fruit_Wt  Seed_Yield_Plant  Seedling_length
0  Natural      1.85            147.70            16.86
1  Natural      1.86            136.86            16.77
2  Natural      1.83            149.97            16.35
3  Natural      1.89            172.33            18.26
4  Natural      1.80            144.46            17.90

In [32]:
pollination_group1 = pollination.loc[0:9]

In [33]:
pollination_group1.tail()

     Group  Fruit_Wt  Seed_Yield_Plant  Seedling_length
5  Natural      1.88            138.30            16.95
6  Natural      1.89            150.58            18.15
7  Natural      1.79            140.99            18.86
8  Natural      1.85            140.57            18.39
9  Natural      1.84            138.33            18.58

In [34]:
pollination_group2 = pollination.loc[10:]

In [36]:
pollination_group2.tail()

   Group  Fruit_Wt  Seed_Yield_Plant  Seedling_length
15  Hand      2.56            216.52            18.49
16  Hand      2.34            211.93            17.45
17  Hand      2.67            210.37            18.97
18  Hand      2.45            199.87            19.31
19  Hand      2.44            214.30            19.36

In [38]:
pollination_group2.shape

(10, 4)

Is the overall population of Seed yield/plant (g) equals to 200?

Test whether the natural pollination and hand pollination under open field conditions are equally effective or are significantly different.
4.

#5.

In [39]:
dvd  = pd.read_csv("C:/Users/Latha/Downloads/dvdplayer.csv")

In [40]:
dvd.head()

      agegroup   dvdscore
0  65 and over  38.454803
1        55-64  17.669677
2  65 and over  31.704307
3  65 and over  25.924460
4     Under 25  30.450007

In [45]:
dvd['agegroup'].value_counts()

65 and over    17
Under 25       13
35-44          12
45-54          10
25-34          10
55-64           6
Name: agegroup, dtype: int64

In [60]:
#s1 = dvd['agegroup']=='65 and over'
s1 = dvd.dvdscore[dvd.agegroup=='65 and over']
#s2 = dvd['agegroup']=='Under 25'
s2 = dvd.dvdscore[dvd.agegroup=='Under 25']
#s3 = dvd['agegroup']=='35-44'
s3 = dvd.dvdscore[dvd.agegroup=='35-44']
#s4 = dvd['agegroup']=='45-54'
s4 = dvd.dvdscore[dvd.agegroup=='45-54']
#s5 = dvd['agegroup']=='25-34'
s5 = dvd.dvdscore[dvd.agegroup=='25-34']
#s6 = dvd['agegroup']=='55-64'
s6 = dvd.dvdscore[dvd.agegroup=='55-64']

In [58]:
s7 = dvd.dvdscore[dvd.agegroup=='65 and over']
#s1 = cust.Latest_mon_usage[cust.segment==1]
s7

0     38.454803
2     31.704307
3     25.924460
6     29.677695
8     23.509700
13    27.563325
18    26.728349
25    25.175482
27    27.837498
39    24.910108
44    15.734473
49    31.769032
53    24.484316
58    30.360900
62    34.675011
64    23.999491
66    33.538502
Name: dvdscore, dtype: float64

ANOVA Test

In [61]:
stats.f_oneway(s1, s2, s3,s4,s5,s6)

F_onewayResult(statistic=6.992526962676517, pvalue=3.087324905679639e-05)

In [49]:
stats.f_oneway(s1, s2, s3,s4,s5,s6)

F_onewayResult(statistic=1.4298996302165874, pvalue=0.21236883477640198)

In [62]:
dvd.dvdscore.mean()

31.95076354936375

In [64]:
dvd.dvdscore.std()

7.3199922396913495

In [63]:
print(s1.mean()); print(s2.mean()); print(s3.mean());print(s4.mean());print(s5.mean());print(s6.mean())

28.00279130552502
28.749228425584857
37.018058228022774
39.1183687318563
31.67800994228487
28.447335692086785

In [53]:
print(s1.mean()); print(s2.mean()); print(s3.mean());print(s4.mean());print(s5.mean());print(s6.mean())

0.25
0.19117647058823528
0.17647058823529413
0.14705882352941177
0.14705882352941177
0.08823529411764706

In [41]:
sample_survey =  pd.read_csv("C:/Users/Latha/Downloads/sample_survey.csv")

In [42]:
sample_survey.head()

,id,wrkstat,marital,childs,age,educ,paeduc,maeduc,speduc,degree,...,agecat,childcat,news1,news2,news3,news4,news5,car1,car2,car3
0,1,Working full time,Divorced,2.0,60.0,12.0,12.0,12.0,NaN,High school,...,55 to 64,1-2,No,No,No,No,No,American,Japanese,Japanese
1,2,Working part-time,Never married,0.0,27.0,17.0,20.0,NaN,NaN,Junior college,...,25 to 34,None,No,No,Yes,No,No,American,German,Japanese
2,3,Working full time,Married,2.0,36.0,12.0,12.0,12.0,16.0,High school,...,35 to 44,1-2,No,No,No,Yes,Yes,American,American,NaN
3,4,Working full time,Never married,0.0,21.0,13.0,NaN,12.0,NaN,High school,...,Less than 25,None,No,No,No,Yes,Yes,American,Other,NaN
4,5,Working full time,Never married,0.0,35.0,16.0,NaN,12.0,NaN,Bachelor,...,35 to 44,None,No,No,No,No,No,American,American,Korean

a. Is there any relationship in between labour force status with marital status?
b. Do you think educational qualification is somehow controlling the marital status?
c. Is happiness  driven by earnings or marital status?